[
  {
    "id": "1",
    "name": "Lukmon Abdulsalam",
    "role": "Robotics Engineer",
    "imageUrl": "https://i.postimg.cc/MKnHnwkt/20240709-122144.jpg",
    "imageHint": "mechanical engineer",
    "bio": "Lukmon is a software engineer by practice and Robotics engineer by study.",
    "social": {
      "linkedin": "www.linkedin.com/in/Lukmon-Abdulsalam"
    }
  },
  {
    "id": "2",
    "name": "Jude Tochy",
    "role": "Software Engineer",
    "imageUrl": "https://i.postimg.cc/bvgJHsCt/jude1.jpg",
    "imageHint": "software engineer",
    "bio": "Jude is focused on building solutions that solve hard real world problems and building generational wealth.",
    "social": {
      "linkedin": "#"
    }
  },
  {
    "id": "3",
    "name": "Magaret Awojide",
    "role": "AI Researcher",
    "imageUrl": "https://i.postimg.cc/BvcqvdHX/IMG-9062.jpg",
    "imageHint": "female researcher",
    "bio": "Margaret is a data professional with a background in statistics and mathematics, specializing in data analysis, data science, and data storytelling. She has experience working in the media sector, where she applies market research and analytics to generate insights and support decision-making. During her academic years, she volunteered as a Tableau ambassador, supporting data visualization learning and community engagement. At AIRLAB, she supported research and analytics and contributed to capacity-building workshops.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/margaret-awojide/"
    }
  },
  {
    "id": "4",
    "name": "Ifedayo Olowoyo",
    "role": "Robotics Engineer",
    "imageUrl": "https://i.postimg.cc/d15qKpTd/IMG-20250923-173101.jpg",
    "imageHint": "robotics expert",
    "bio": "Ifedayo is a technology and engineering enthusiast with a strong interest in electronics, robotics, and intelligent systems. He is actively involved in designing and building innovative hardware projects, including embedded systems, IoT solutions, and automation based applications. With a passion for research, hands-on development, and problem solving approach.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/olowoyoifedayo22"
    }
  },
  {
    "id": "13",
    "name": "Zaynab Awofeso",
    "role": "AI/ML Researcher",
    "imageUrl": "https://i.postimg.cc/dtPJTZdZ/Zaynab-Awofeso.avif",
    "imageHint": "female researcher",
    "bio": "Zaynab is a computer science student and researcher whose work centers on efficiency and optimization in machine learning. One of her strongest convictions is that the universe’s resources are limited, and this naturally shapes the kinds of questions that keep her up at 3 a.m., like how we can strip systems to their core and design methods that are truly resource-aware. Beyond research, she enjoys writing as a form of artistic expression and a way to make sense of the world.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/zaynab-awofeso/"
    }
  },
  {
    "id": "5",
    "name": "Mbanefo Oziomachukwu",
    "role": "Graphic Designer",
    "imageUrl": "https://i.postimg.cc/1X5mNJsx/IMG-4081.jpg",
    "imageHint": "male student",
    "bio": "A versatile creative professional, Mbanefo Oziomachukwu brings a comprehensive background in Graphic Design, Brand Identity, and Motion Graphics. Hespecializes in translating complex brand values into cohesive visual systems that move. From crafting the foundational logo to animating the final broadcast assets, Mbanefo Oziomachukwu offers a full-spectrum design service. His work is characterized by clean aesthetics, purposeful motion, and a strong focus on effective visual communication.",
    "social": {
      "linkedin": "http://linkedin.com/in/mbanefo-oziomachukwu"
    }
  },
  {
    "id": "6",
    "name": "Damilola Latifat",
    "role": "Robotics Assistant",
    "imageUrl": "https://i.postimg.cc/kg1KnQ2D/E98C0A94-2159-44D6-880C-3389B7756D1F.jpg",
    "imageHint": "female assistant",
    "bio": "⁠Latifat is a robotics enthusiast and marketing associate at PipeOps with a strong passion for robotics, engineering, and hands-on hardware work. She bakes as a creative hobby. She is known for her strong maintenance skills, open-mindedness and determination to achieve her goals.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/damilola-latifat"
    }
  },
  {
    "id": "9",
    "name": "Ayomide Atunrase",
    "role": "AI/ML Engineer",
    "imageUrl": "https://i.postimg.cc/LsgWTnkQ/Atunrase_Ayomide_17_05.jpg",
    "imageHint": "male ai researcher",
    "bio": "Ayomide Atunrase is an AI/ML engineer, data engineer, and researcher focused on building practical, production-ready intelligence systems. His work spans applied machine learning, small and large language models, agentic workflows, and open-source tooling, with a strong interest in real-world AI deployment and automation pipelines. He is deeply motivated by environmental impact and the application of AI to biomedical and healthcare challenges, and is driven to build scalable solutions that address problems at national, Africa-wide, and global scales.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/ayo-atunrase"
    }
  },
  {
    "id": "12",
    "name": "Anuoluwapo Oluwatobi",
    "role": "Robotics Instructor",
    "imageUrl": "https://i.postimg.cc/x1TpjHnf/Me.jpg",
    "imageHint": "female instructor",
    "bio": "Anuoluwapo Oluwatobi is an aspiring mechanical engineer with a strong interest in applied research and practical engineering, particularly in the development of functional, real-world systems. Her experience spans robotics, mechanical system design, CAD modeling and simulation, and hands-on fabrication, where she applies engineering theory to the analysis, design, testing, and refinement of physical systems. Through sustained, project-based work, she has developed a thoughtful, detail-oriented, and execution-focused problem-solving approach that bridges theoretical rigor with manufacturable and experimentally validated solutions.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/anuoluwatobi/"
    }
  },
  {
    "id": "7",
    "name": "Joel Ejime",
    "role": "Contents Lead",
    "imageUrl": "https://i.postimg.cc/7LjH96WX/Joel-Picture.png",
    "imageHint": "male student",
    "bio": "Joel has a background in electrical engineering and robotics and contributes at the Artificial Intelligence and Robotics Laboratory (AIRLAB), supporting writing, social media management, and storytelling that bring visibility, creativity, and polish to the lab’s technical work and public presence.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/ejimejoel/"
    }
  },
  {
    "id": "8",
    "name": "Richie Adigwe",
    "role": "Software Engineer",
    "imageUrl": "https://i.postimg.cc/MpQ0S3y9/IMG-8458.jpg",
    "imageHint": "male student",
    "bio": "Richie has a background in Computer Science with a strong interest in AI and Software Engineering. He is passionate about building automations, AI integration, and developing APIs.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/richie-adigwe"
    }
  },

  {
    "id": "10",
    "name": "Egbetokun Timilehin",
    "role": "Software Developer",
    "imageUrl": "https://i.postimg.cc/h4mXhY2Q/IMG-0417.jpg",
    "imageHint": "male student",
    "bio": "Egbetokun Timilehin is a Nigerian software developer and engineering student known for his work in technology and robotics.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/egbetokun-timilehin"
    }
  },
  {
    "id": "11",
    "name": "Lawal Giyath",
    "role": "Software Developer",
    "imageUrl": "https://i.postimg.cc/fy6ct1XJ/photo-5796573375940463552-y.jpg",
    "imageHint": "software developer",
    "bio": "Lawal Giyath is characterized by a commitment to technical excellence and a drive for continuous learning. Having navigated the complexities of back-to-back FTC seasons and hackathons, they have developed a sophisticated understanding of mechanical systems,  IoT systems and iterative problem-solving. Whether tackling hardware builds or software integration, Giyath brings a disciplined, competitive edge to every project they undertake.",
    "social": {
      "linkedin": "https://www.linkedin.com/in/richie-adigwe"
    }
  }
]
